#include "DP32G030_dma.h"

/****************************************************************************************************************************************** 
* 函数名称: DMA_Channel_Init()
* 功能说明:	DMA通道初始化 
* 输    入: CH_TypeDef  CHx    通道号  
            DMA_ChannelInitTypeDef  * DMA_ChannelInitStruct    DMA初始化参数
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_Channel_Init(CH_TypeDef  CHx,DMA_ChannelInitTypeDef  * DMA_ChannelInitStruct)
{
	uint32_t temp = 0;
	
	assert_param(IS_DMA_CH(CHx));                                                     //检查输入的参数CHx是否合法                      
	
	assert_param(IS_DMA_PRI(DMA_ChannelInitStruct->Priority));                        //检查输入的参数Priority是否合法                      
	
	assert_param(IS_DMA_ADDRMODE(DMA_ChannelInitStruct->MS_AddrMode));                //检查输入的参数MS_AddrMode是否合法                      
	
	assert_param(IS_DMA_ADDRMODE(DMA_ChannelInitStruct->MD_AddrMode));                //检查输入的参数MD_AddrMode是否合法                      
	
	assert_param(IS_DMA_ADDRSIZE(DMA_ChannelInitStruct->MS_AddrSize));                //检查输入的参数MS_AddrSize是否合法                      
	
	assert_param(IS_DMA_ADDRSIZE(DMA_ChannelInitStruct->MD_AddrSize));                //检查输入的参数MD_AddrSize是否合法                      
	
	
	DMA->CTR &= ~(0x01 << DMA_CTR_EN_POS);                                                     //DMA关闭
	
	temp = DMA->CH[CHx].CH_CTR;
	
	temp &= ~(0x01 << DMA_CH_CTR_EN_POS);                                       //DMA通道禁能
	
	temp &= ~(0xFFF << DMA_CH_CTR_LENTH_POS);   
	temp |= (DMA_ChannelInitStruct->Lenth << DMA_CH_CTR_LENTH_POS);             //DMA通道传输数据数量

	temp &= ~(0x01 << DMA_CH_CTR_LOOP_POS);
	temp |= (DMA_ChannelInitStruct->Loop << DMA_CH_CTR_LOOP_POS);               //DMA通道循环方式
	
	temp &= ~(0x03 << DMA_CH_CTR_PRI_POS);  
	temp |= (DMA_ChannelInitStruct->Priority << DMA_CH_CTR_PRI_POS);            //DMA通道优先级
	
	DMA->CH[CHx].CH_CTR = temp;
	
	DMA->CH[CHx].CH_MSADDR = DMA_ChannelInitStruct->MS_Addr;                                   //DMA通道MS侧地址
	
	DMA->CH[CHx].CH_MDADDR = DMA_ChannelInitStruct->MD_Addr;                                   //DMA通道MD侧地址
	
	temp = DMA->CH[CHx].CH_MODE;
	
	temp &= ~(0x01 << DMA_CH_MODE_MS_ADDR_POS);  
	temp |= (DMA_ChannelInitStruct->MS_AddrMode << DMA_CH_MODE_MS_ADDR_POS);   //DMA通道MS侧地址变化方式选择
	
	temp &= ~(0x03 << DMA_CH_MODE_MS_SIZE_POS);  
	temp |= (DMA_ChannelInitStruct->MS_AddrSize << DMA_CH_MODE_MS_SIZE_POS);   //DMA通道MS侧总线传输宽度
	
	temp &= ~(0x07 << DMA_CH_MODE_MS_SEL_POS);  
	temp |= (DMA_ChannelInitStruct->MS_Sel << DMA_CH_MODE_MS_SEL_POS);         //DMA通道的MS侧外设选择
	
	temp &= ~(0x01 << DMA_CH_MODE_MD_ADDR_POS);  
	temp |= (DMA_ChannelInitStruct->MD_AddrMode << DMA_CH_MODE_MD_ADDR_POS);   //DMA通道MD侧地址变化方式选择
	
	temp &= ~(0x03 << DMA_CH_MODE_MD_SIZE_POS);  
	temp |= (DMA_ChannelInitStruct->MD_AddrSize << DMA_CH_MODE_MD_SIZE_POS);   //DMA通道MD侧总线传输宽度
	
	temp &= ~(0x07 << DMA_CH_MODE_MD_SEL_POS);  
	temp |= (DMA_ChannelInitStruct->MD_Sel << DMA_CH_MODE_MD_SEL_POS);         //DMA通道的MD侧外设选择
	
	DMA->CH[CHx].CH_MODE = temp;
	
	if(DMA_ChannelInitStruct->Complete_IE == ENABLE)
	{
		DMA->INTEN |= ((0x01 << CHx) << DMA_INTEN_CH0_TC_EN_POS);    //传输完成中断使能
	}
	else
	{
		DMA->INTEN &= ~((0x01 << CHx) << DMA_INTEN_CH0_TC_EN_POS);   //传输完成中断禁能
	}
	
	if(DMA_ChannelInitStruct->HalfComplete_IE == ENABLE)
	{
		DMA->INTEN |= ((0x01 << CHx) << DMA_INTEN_CH0_THC_EN_POS);   //传输一半完成中断使能
	}
	else
	{
		DMA->INTEN &= ~((0x01 << CHx) << DMA_INTEN_CH0_THC_EN_POS);  //传输一半完成中断禁能
	}
	
	if(DMA_ChannelInitStruct->Complete_IE == ENABLE || DMA_ChannelInitStruct->HalfComplete_IE == ENABLE)
	{
		NVIC_EnableIRQ(DMA_IRQn);
	}
	
	DMA->INTST = 0xF0F;    //清除中断状态 
	
	DMA->CH[CHx].CH_CTR |= (0x01 << DMA_CH_CTR_EN_POS);              //DMA通道使能
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_Open()
* 功能说明:	DMA打开 
* 输    入: 无   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_Open(void)
{
	DMA->CTR |= 0x01 << DMA_CTR_EN_POS;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_Close()
* 功能说明:	DMA关闭
* 输    入: 无   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_Close(void)
{
	DMA->CTR &= ~(0x01 << DMA_CTR_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_En()
* 功能说明:	DMA通道使能
* 输    入: CH_TypeDef  CHx   通道号 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_En(CH_TypeDef  CHx)
{
	DMA->CH[CHx].CH_CTR |= (0x01 << DMA_CH_CTR_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_Dis()
* 功能说明:	DMA通道禁能
* 输    入: CH_TypeDef  CHx   通道号 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_Dis(CH_TypeDef  CHx)
{
	DMA->CH[CHx].CH_CTR &= ~(0x01 << DMA_CH_CTR_EN_POS);  
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_Set_Lenth()
* 功能说明:	DMA通道传输数据数量配置
* 输    入: CH_TypeDef  CHx   通道号 
            uint16_t Lenth    传输数量 1-4096
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_Set_Lenth(CH_TypeDef  CHx,uint16_t Lenth)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[CHx].CH_CTR;
	
	temp &= ~(0xFFF << DMA_CH_CTR_LENTH_POS);  
	temp |= (Lenth << DMA_CH_CTR_LENTH_POS);
	
	DMA->CH[CHx].CH_CTR = temp;
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_Loop_En()
* 功能说明:	DMA通道循环方式使能
* 输    入: CH_TypeDef  CHx   通道号 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_Loop_En(CH_TypeDef  CHx)
{
	DMA->CH[CHx].CH_CTR |= (0x01 << DMA_CH_CTR_LOOP_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_Loop_Dis()
* 功能说明:	DMA通道循环方式禁能
* 输    入: CH_TypeDef  CHx   通道号 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_Loop_Dis(CH_TypeDef  CHx)
{
	DMA->CH[CHx].CH_CTR &= ~(0x01 << DMA_CH_CTR_LOOP_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_Set_Priority()
* 功能说明:	DMA通道优先级配置
* 输    入: CH_TypeDef  CHx   通道号 
            PRI_TypeDef Priority  优先级   00 低  01  中  10 高  11 最高
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_Set_Priority(CH_TypeDef  CHx,PRI_TypeDef Priority)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[CHx].CH_CTR;
	
	temp &= ~(0x03 << DMA_CH_CTR_PRI_POS);  
	temp |= (Priority << DMA_CH_CTR_PRI_POS);
	
	DMA->CH[CHx].CH_CTR = temp;
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_SwReq_En()
* 功能说明:	DMA通道软件方式请求发送 
* 输    入: CH_TypeDef  CHx   通道号 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_SwReq_En(CH_TypeDef  CHx)
{
	DMA->CH[CHx].CH_CTR |= (0x01 << DMA_CH_CTR_SWREQ_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_MS_AddrMode()
* 功能说明:	DMA通道MS侧地址变化方式选择
* 输    入: CH_TypeDef  CHx   通道号 
            ADDR_MODE_TypeDef AddrMode    0 地址不变  1地址递增
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_MS_AddrMode(CH_TypeDef  CHx,ADDR_MODE_TypeDef AddrMode)
{
	if(AddrMode == ADDR_INC_DIS)
	{
		DMA->CH[CHx].CH_MODE &= ~(0x01 << DMA_CH_MODE_MS_ADDR_POS);  
	}
	else
	{
		DMA->CH[CHx].CH_MODE |= (0x01 << DMA_CH_MODE_MS_ADDR_POS);
	}
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_MS_Size()
* 功能说明:	DMA通道MS侧总线传输宽度
* 输    入: CH_TypeDef  CHx   通道号 
            ADDR_SIZE_TypeDef Size    00 8bits  01  16bits  10  32bits 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_MS_Size(CH_TypeDef  CHx,ADDR_SIZE_TypeDef Size)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[CHx].CH_MODE;
	
	temp &= ~(0x03 << DMA_CH_MODE_MS_SIZE_POS);  
	temp |= (Size << DMA_CH_MODE_MS_SIZE_POS);
	
	DMA->CH[CHx].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_MS_Sel()
* 功能说明:	DMA通道0的MS侧外设选择
* 输    入: CH0_MS_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_MS_Sel(CH0_MS_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH0].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MS_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MS_SEL_POS);
	
	DMA->CH[DMA_CH0].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_MS_Sel()
* 功能说明:	DMA通道1的MS侧外设选择
* 输    入: CH1_MS_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_MS_Sel(CH1_MS_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH1].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MS_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MS_SEL_POS);
	
	DMA->CH[DMA_CH1].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_MS_Sel()
* 功能说明:	DMA通道2的MS侧外设选择
* 输    入: CH2_MS_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_MS_Sel(CH2_MS_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH2].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MS_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MS_SEL_POS);
	
	DMA->CH[DMA_CH2].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_MS_Sel()
* 功能说明:	DMA通道3的MS侧外设选择
* 输    入: CH3_MS_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_MS_Sel(CH3_MS_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH3].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MS_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MS_SEL_POS);
	
	DMA->CH[DMA_CH3].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_MD_AddrMode()
* 功能说明:	DMA通道MD侧地址变化方式选择
* 输    入: CH_TypeDef  CHx   通道号 
            ADDR_MODE_TypeDef AddrMode    0 地址不变  1地址递增
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_MD_AddrMode(CH_TypeDef  CHx,ADDR_MODE_TypeDef AddrMode)
{
	if(AddrMode == ADDR_INC_DIS)
	{
		DMA->CH[CHx].CH_MODE &= ~(0x01 << DMA_CH_MODE_MD_ADDR_POS);  
	}
	else
	{
		DMA->CH[CHx].CH_MODE |= (0x01 << DMA_CH_MODE_MD_ADDR_POS);
	}
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_MD_Size()
* 功能说明:	DMA通道MD侧总线传输宽度
* 输    入: CH_TypeDef  CHx   通道号 
            ADDR_SIZE_TypeDef Size    00 8bits  01  16bits  10  32bits 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH_MD_Size(CH_TypeDef  CHx,ADDR_SIZE_TypeDef Size)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[CHx].CH_MODE;
	
	temp &= ~(0x03 << DMA_CH_MODE_MD_SIZE_POS);  
	temp |=  (Size << DMA_CH_MODE_MD_SIZE_POS);
	
	DMA->CH[CHx].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_MD_Sel()
* 功能说明:	DMA通道0的MD侧外设选择
* 输    入: CH0_MD_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_MD_Sel(CH0_MD_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH0].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MD_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MD_SEL_POS);
	
	DMA->CH[DMA_CH0].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_MD_Sel()
* 功能说明:	DMA通道1的MD侧外设选择
* 输    入: CH1_MD_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_MD_Sel(CH1_MD_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH1].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MD_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MD_SEL_POS);
	
	DMA->CH[DMA_CH1].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_MD_Sel()
* 功能说明:	DMA通道2的MD侧外设选择
* 输    入: CH2_MD_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_MD_Sel(CH2_MD_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH2].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MD_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MD_SEL_POS);
	
	DMA->CH[DMA_CH2].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_MD_Sel()
* 功能说明:	DMA通道3的MD侧外设选择
* 输    入: CH3_MD_TypeDef  Sel   外设选择
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_MD_Sel(CH3_MD_TypeDef  Sel)
{
	uint32_t temp = 0;
	
	temp = DMA->CH[DMA_CH3].CH_MODE;
	
	temp &= ~(0x07 << DMA_CH_MODE_MD_SEL_POS);  
	temp |= (Sel << DMA_CH_MODE_MD_SEL_POS);
	
	DMA->CH[DMA_CH3].CH_MODE = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_Complete_En()
* 功能说明:	DMA通道0的传输完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_Int_Complete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH0_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_Trans_Complete_Dis()
* 功能说明:	DMA通道0的传输完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_Int_Complete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH0_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_Complete_Clr()
* 功能说明:	DMA通道0的传输完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_Int_Complete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH0_TC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_Complete_State()
* 功能说明:	获取DMA通道0的传输完成中断状态
* 输    入: 无
* 输    出: 传输完成中断状态  1  传输完成  0 传输未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH0_Int_Complete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH0_TC_ST_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_Complete_En()
* 功能说明:	DMA通道1的传输完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_Int_Complete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH1_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_Trans_Complete_Dis()
* 功能说明:	DMA通道1的传输完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_Int_Complete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH1_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_Complete_Clr()
* 功能说明:	DMA通道1的传输完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_Int_Complete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH1_TC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_Complete_State()
* 功能说明:	获取DMA通道1的传输完成中断状态
* 输    入: 无
* 输    出: 传输完成中断状态  1  传输完成  0 传输未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH1_Int_Complete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH1_TC_ST_MSK) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_Complete_En()
* 功能说明:	DMA通道2的传输完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_Int_Complete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH2_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_Trans_Complete_Dis()
* 功能说明:	DMA通道2的传输完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_Int_Complete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH2_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_Complete_Clr()
* 功能说明:	DMA通道2的传输完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_Int_Complete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH2_TC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_Complete_State()
* 功能说明:	获取DMA通道2的传输完成中断状态
* 输    入: 无
* 输    出: 传输完成中断状态  1  传输完成  0 传输未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH2_Int_Complete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH2_TC_ST_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_Complete_En()
* 功能说明:	DMA通道3的传输完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_Int_Complete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH3_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_Trans_Complete_Dis()
* 功能说明:	DMA通道3的传输完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_Int_Complete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH3_TC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_Complete_Clr()
* 功能说明:	DMA通道3的传输完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_Int_Complete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH3_TC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_Complete_State()
* 功能说明:	获取DMA通道3的传输完成中断状态
* 输    入: 无
* 输    出: 传输完成中断状态  1  传输完成  0 传输未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH3_Int_Complete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH3_TC_ST_MSK) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_HalfComplete_En()
* 功能说明:	DMA通道0的传输一半完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_Int_HalfComplete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH0_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_HalfComplete_Dis()
* 功能说明:	DMA通道0的传输一半完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_Int_HalfComplete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH0_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_HalfComplete_Clr()
* 功能说明:	DMA通道0的传输一半完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH0_Int_HalfComplete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH0_THC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH0_Int_HalfComplete_State()
* 功能说明:	获取DMA通道0的传输一半完成中断状态
* 输    入: 无
* 输    出: 传输一半完成中断状态  1  传输一半完成  0 传输一半未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH0_Int_HalfComplete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH0_THC_ST_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_HalfComplete_En()
* 功能说明:	DMA通道1的传输一半完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_Int_HalfComplete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH1_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_HalfComplete_Dis()
* 功能说明:	DMA通道1的传输一半完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_Int_HalfComplete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH1_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_HalfComplete_Clr()
* 功能说明:	DMA通道1的传输一半完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH1_Int_HalfComplete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH1_THC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH1_Int_HalfComplete_State()
* 功能说明:	获取DMA通道1的传输一半完成中断状态
* 输    入: 无
* 输    出: 传输一半完成中断状态  1  传输一半完成  0 传输一半未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH1_Int_HalfComplete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH1_THC_ST_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_HalfComplete_En()
* 功能说明:	DMA通道2的传输一半完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_Int_HalfComplete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH2_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_HalfComplete_Dis()
* 功能说明:	DMA通道2的传输一半完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_Int_HalfComplete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH2_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_HalfComplete_Clr()
* 功能说明:	DMA通道2的传输一半完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH2_Int_HalfComplete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH2_THC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH2_Int_HalfComplete_State()
* 功能说明:	获取DMA通道2的传输一半完成中断状态
* 输    入: 无
* 输    出: 传输一半完成中断状态  1  传输一半完成  0 传输一半未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH2_Int_HalfComplete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH2_THC_ST_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_HalfComplete_En()
* 功能说明:	DMA通道3的传输一半完成中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_Int_HalfComplete_En(void)
{
	DMA->INTEN |= (0x01 << DMA_INTEN_CH3_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_HalfComplete_Dis()
* 功能说明:	DMA通道3的传输一半完成中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_Int_HalfComplete_Dis(void)
{
	DMA->INTEN &= ~(0x01 << DMA_INTEN_CH3_THC_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_HalfComplete_Clr()
* 功能说明:	DMA通道3的传输一半完成中断状态清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void DMA_CH3_Int_HalfComplete_Clr(void)
{
	DMA->INTST = (0x01 << DMA_INTST_CH3_THC_ST_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH3_Int_HalfComplete_State()
* 功能说明:	获取DMA通道3的传输一半完成中断状态
* 输    入: 无
* 输    出: 传输一半完成中断状态  1  传输一半完成  0 传输一半未完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t DMA_CH3_Int_HalfComplete_State(void)
{
	return (DMA->INTST & DMA_INTST_CH3_THC_ST_MSK) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称: DMA_CH_Get_CurLenth()
* 功能说明:	获取DMA通道当前传输个数
* 输    入: CH_TypeDef  CHx   通道号 
* 输    出: 当前传输个数
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t DMA_CH_Get_CurLenth(CH_TypeDef  CHx)
{
	return (DMA->CH[CHx].CH_ST & 0xFFF); 
}


