#include "DP32G030_iic.h"


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Init()
* 功能说明:	IIC初始化
* 输    入: 		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Init(IIC_TypeDef *IICx,IIC_InitTypeDef * IIC_InitStruct)
{
	uint32_t temp = 0,div = 0,scl_high = 0,scl_low = 0;
	
	assert_param(IS_IIC_MODE(IIC_InitStruct->Master));                         //检查输入的参数Master是否合法     
	
	assert_param(IS_IIC_SLAVE_ADDRMODE(IIC_InitStruct->Slave_Addr_Mode));      //检查输入的参数Slave_Addr_Mode是否合法     
	
	switch((uint32_t)IICx)
	{
		case ((uint32_t)IIC0):
			
			SYS->CLKEN |= 0x01 << SYS_CLKEN_IIC0_POS;         //开启IIC0时钟
		
		break;
		
		case ((uint32_t)IIC1):
			
			SYS->CLKEN |= 0x01 << SYS_CLKEN_IIC1_POS;         //开启IIC1时钟
		
		break;
	}
	
	IIC_Close(IICx);                                     //关闭IIC
	
	
	 
	
	if(IIC_InitStruct->Master == MASTER_MODE)
	{
		//tLOW = (SCL_LOW+1)*(CPD+1)+DAT_HD+5   tHIGH = (SCL_HI+1)*(CPD+1)+DNF+6    推荐tHIGH:tLOW=1:2
		//为了方便计算，这里把DAT_HD设置为2  DNF设置为1
		
		IICx->CCFG |= 0x01 << IIC_CCFG_MODE_POS;           //主机模式
		
		if(SystemCoreClock/(3000*IIC_InitStruct->BaudRate) > 8)
		{
			temp = IICx->CCFG;
			
			temp &= ~(IIC_CCFG_DNF_MSK);
			temp |= 0x01 << IIC_CCFG_DNF_POS;              //DNF设置为1
			
			IICx->CCFG = temp;
			
			temp = IICx->MSPC;
			
			temp &= ~(IIC_MSPC_DATAHOLD_MSK);
			temp |= 0x02 << IIC_MSPC_DATAHOLD_POS;         //DAT_HD设置为2

			div = (SystemCoreClock/(1000*IIC_InitStruct->BaudRate)) >> 8;    //计算时钟预分频值      BaudRate单位为K
			
			temp &= ~(IIC_MSPC_CPD_MSK);
			temp |= div << IIC_MSPC_CPD_POS;               //配置时钟预分频
			
			scl_high = (SystemCoreClock/(3000*IIC_InitStruct->BaudRate)- 7)/(div+1) - 1;                       //计算SCL_HIGH    占1/3
			scl_low  = (2*SystemCoreClock/(3000*IIC_InitStruct->BaudRate) - 7)/(div+1) - 1;                    //计算SCL_LOW     占2/3
			
			temp &= ~(IIC_MSPC_SCL_HI_MSK);
			temp |= scl_high << IIC_MSPC_SCL_HI_POS;       //配置SCL_HIGH
			
			temp &= ~(IIC_MSPC_SCL_LOW_MSK);
			temp |= scl_low << IIC_MSPC_SCL_LOW_POS;       //配置SCL_LOW  
			
			IICx->MSPC = temp;
		}
	}
	else if(IIC_InitStruct->Master == SLAVE_MODE)
	{
		IICx->CCFG &= ~(0x01 << IIC_CCFG_MODE_POS);          //从机模式
		
		if(IIC_InitStruct->Slave_Addr_Mode == SLAVE_ADDR_7BIT)
		{
			IICx->SCTRL &= ~(IIC_SCTRL_ADMD_MSK);            //7位地址模式
			
			IICx->SADDR = (IIC_InitStruct->Slave_Addr << IIC_SADDR_ADDR1_7_POS)|(IIC_InitStruct->Slave_Addr_Mask << IIC_SADDR_MASK_ADDR1_7_POS);   //配置7位地址及掩码	
		}
		else if(IIC_InitStruct->Slave_Addr_Mode == SLAVE_ADDR_10BIT)
		{
			IICx->SCTRL |= 0x01 << IIC_SCTRL_ADMD_POS;       //10位地址模式 
			
			IICx->SADDR = (IIC_InitStruct->Slave_Addr << IIC_SADDR_ADDR0_POS)|(IIC_InitStruct->Slave_Addr_Mask << IIC_SADDR_MASK_ADDR0_POS);      //配置10位地址及掩码
		}
		
		temp = IICx->CCFG;
		
		temp &= ~(IIC_CCFG_DNF_MSK);
		temp |= 0x05 << IIC_CCFG_DNF_POS;                                                   //DNF设置为5  
		
		IICx->CCFG = temp;
		
		IICx->SCTRL &= ~(0x01 << IIC_SCTRL_STRETCH_POS);
		IICx->SCTRL |= (IIC_InitStruct->Clock_Stretch << IIC_SCTRL_STRETCH_POS);            //时钟延展功能配置
		
		IICx->SCTRL &= ~(0x01 << IIC_SCTRL_ASDS_POS);
		IICx->SCTRL |= (IIC_InitStruct->Clock_Stretch_Adaptive << IIC_SCTRL_ASDS_POS);      //时钟延展自适应功能配置
	}
	
	temp = 0;
	
	temp |= IIC_InitStruct->RX_Ovf_IE << IIC_IE_RXOVF_POS;         //接收溢出中断配置
	
	temp |= IIC_InitStruct->TX_End_IE << IIC_IE_TXF_POS;           //发送结束中断配置
	
	temp |= IIC_InitStruct->RX_End_IE << IIC_IE_RXF_POS;           //接收结束中断配置
	
	temp |= IIC_InitStruct->Start_IE << IIC_IE_SLV_STA_POS;        //从机检测到START中断配置
	
	temp |= IIC_InitStruct->Stop_IE << IIC_IE_SLV_STO_POS;         //从机检测到STOP中断配置 
	
	temp |= IIC_InitStruct->SCL_LOW_TimeOut_IE << IIC_IE_MLTO_POS; //主机模式下SCL低电平超时中断使能配置
	
	IICx->IE = temp;
	
	if(IICx->IE != 0)
	{
		switch((uint32_t)IICx)
		{
			case ((uint32_t)IIC0):
				
				NVIC_EnableIRQ(IIC0_IRQn);                    //使能IIC0中断
			
			break;
			
			case ((uint32_t)IIC1):
				
				NVIC_EnableIRQ(IIC1_IRQn);                    //使能IIC1中断
			
			break;
		}
	}
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Open()
* 功能说明:	IIC打开，允许收发
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Open(IIC_TypeDef *IICx)
{
	IICx->CCFG |= (0x01 << IIC_CCFG_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Close()
* 功能说明:	IIC关闭，禁止收发
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Close(IIC_TypeDef *IICx)
{
	IICx->CCFG &= ~(0x01 << IIC_CCFG_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Start()
* 功能说明:	产生起始信号并发送设备地址
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint8_t addr	    设备地址			
* 输    出: uint8_t			    1 接收到ACK   0 接收到NACK
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Start(IIC_TypeDef *IICx,uint8_t addr)
{
	IICx->TXDATA = addr;                                                        //从机地址
	IICx->MCTRL  = (0x01 << IIC_MCTRL_STA_POS)|(0x01 << IIC_MCTRL_WR_POS);      //发送起始位和从机地址
	
	while(IICx->MCTRL & IIC_MCTRL_WR_MSK) __NOP();		       //等待发送完成
	return (IICx->CTRANS & IIC_CTRANS_RX_ACK_MSK) ? 0 : 1;     //返回接收到的应答信号
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Start_10bit()
* 功能说明:	产生起始信号并发送设备地址  10位地址
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint16_t addr	    设备地址
            uint8_t readwrite   读写操作选择
* 输    出: uint8_t			    1 接收到ACK   0 接收到NACK
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Start_10bit(IIC_TypeDef *IICx,uint16_t addr,uint8_t readwrite)
{
	IICx->TXDATA = 0xF0 | ((addr>>8)&0x06) | readwrite;                         //从机地址 9位和8位
	IICx->MCTRL  = (0x01 << IIC_MCTRL_STA_POS)|(0x01 << IIC_MCTRL_WR_POS);      //发送起始位和从机地址  9位和8位
	while(IICx->MCTRL & IIC_MCTRL_WR_MSK) __NOP();		                        //等待发送完成
	
	if((IICx->CTRANS & IIC_CTRANS_RX_ACK_MSK) == 1)
	{
		return 0;
	}
	
	IICx->TXDATA = addr&0xFF;                                                   //从机地址 7-0位
	IICx->MCTRL  = (0x01 << IIC_MCTRL_STA_POS)|(0x01 << IIC_MCTRL_WR_POS);      //发送起始位和从机地址
	
	while(IICx->MCTRL & IIC_MCTRL_WR_MSK) __NOP();		       //等待发送完成
	return (IICx->CTRANS & IIC_CTRANS_RX_ACK_MSK) ? 0 : 1;     //返回接收到的应答信号
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Stop()
* 功能说明:	产生停止信号
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Stop(IIC_TypeDef *IICx)
{
	IICx->MCTRL = (0x01 << IIC_MCTRL_STO_POS);          //产生停止信号
	while(IICx->MCTRL & IIC_MCTRL_STO_MSK) __NOP();		//总线忙检测
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_Write()
* 功能说明:	写入一个数据
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint8_t data		要写的数据			
* 输    出: uint8_t				1 接收到ACK   0 接收到NACK
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Write(IIC_TypeDef *IICx,uint8_t data)
{	
	IICx->TXDATA = data;                                       //待写入的数据
	IICx->MCTRL = (0x01 << IIC_MCTRL_WR_POS);                  //写命令
	while(IICx->MCTRL & IIC_MCTRL_WR_MSK)  __NOP();		       //等待发送完成
	return (IICx->CTRANS & IIC_CTRANS_RX_ACK_MSK) ? 0 : 1;     //返回接收到的应答信号
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Read()
* 功能说明:	读取一个数据
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint8_t ack			1 发送ACK   0 发送NACK			
* 输    出: uint8_t				读取到的数据
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Read(IIC_TypeDef *IICx,uint8_t ack)
{
	IICx->CTRANS = ((ack ? 0 : 1) << IIC_CTRANS_TX_ACK_POS);                           //反馈应答信号
	IICx->MCTRL = (0x01 << IIC_MCTRL_RD_POS);	                                       //读命令
	while(IICx->MCTRL & IIC_MCTRL_RD_MSK) __NOP();  		                           //等待发送完成 
	return IICx->RXDATA;                                                               //返回读取到的数据            
}


/******************************************************************************************************************************************

以下几个函数是开启IIC中断后调用的函数

*******************************************************************************************************************************************/


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Start_NoWait()
* 功能说明:	产生起始信号并发送设备地址
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint8_t addr	  设备地址			
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Start_NoWait(IIC_TypeDef *IICx,uint8_t addr)
{
	IICx->TXDATA = addr;                                                        //从机地址
	IICx->MCTRL  = (0x01 << IIC_MCTRL_STA_POS)|(0x01 << IIC_MCTRL_WR_POS);      //发送起始位和从机地址
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Start_10bit_First_NoWait()
* 功能说明:	产生起始信号并发送设备地址  10位地址  bit9-8
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint16_t addr	    设备地址
            uint8_t readwrite   读写操作选择
* 输    出: uint8_t			    1 接收到ACK   0 接收到NACK
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Start_10bit_First_NoWait(IIC_TypeDef *IICx,uint16_t addr,uint8_t readwrite)
{
	IICx->TXDATA = 0xF0 | ((addr>>8)&0x06) | readwrite;                         //从机地址 9位和8位
	IICx->MCTRL  = (0x01 << IIC_MCTRL_STA_POS)|(0x01 << IIC_MCTRL_WR_POS);      //发送起始位和从机地址  9位和8位
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_Start_10bit_Second_NoWait()
* 功能说明:	产生起始信号并发送设备地址  10位地址  bit7-0
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint16_t addr	    设备地址
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Start_10bit_Second_NoWait(IIC_TypeDef *IICx,uint16_t addr)
{
	IICx->TXDATA = addr&0xFF;                                                   //从机地址 7-0位
	IICx->MCTRL  = (0x01 << IIC_MCTRL_STA_POS)|(0x01 << IIC_MCTRL_WR_POS);      //发送起始位和从机地址
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Wait_ACK()
* 功能说明:	读取应答信号
* 输    入: IIC_TypeDef *IICx   IIC0 IIC1		
* 输    出:  0  NACK   1  ACK
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Wait_ACK(IIC_TypeDef *IICx)
{
	if((IICx->CTRANS & IIC_CTRANS_RX_ACK_MSK))
	{
		return 0;
	}
	else
	{
		return 1;
	}
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Write()
* 功能说明:	写入一个数据
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
			uint8_t data		要写的数据			
* 输    出: uint8_t				1 接收到ACK   0 接收到NACK
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Write_NoWait(IIC_TypeDef *IICx,uint8_t data)
{	
	IICx->TXDATA = data;                                       //待写入的数据
	IICx->MCTRL = (1 << IIC_MCTRL_WR_POS);                     //写命令
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Read_NoWait()
* 功能说明:	读取一个数据
* 输    入: IIC_TypeDef *IICx   IIC0
			uint8_t ack				1 发送ACK   0 发送NACK			
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Read_NoWait(IIC_TypeDef *IICx,uint8_t ack)
{
	IICx->CTRANS = ((ack ? 0 : 1) << IIC_CTRANS_TX_ACK_POS);     //反馈应答信号
	IICx->MCTRL = (0x01 << IIC_MCTRL_RD_POS);	                 //读命令       
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxOvfEn()
* 功能说明: IIC接收数据溢出中断使能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntRxOvfEn(IIC_TypeDef *IICx)
{	
	IICx->IE |= (0x01 << IIC_IE_RXOVF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxOvfDis()
* 功能说明: IIC接收数据溢出中断禁能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntRxOvfDis(IIC_TypeDef *IICx)
{	
	IICx->IE &= ~(0x01 << IIC_IE_RXOVF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxOvfClr()
* 功能说明: IIC接收数据溢出中断状态清除
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntRxOvfClr(IIC_TypeDef *IICx)
{	
	IICx->IF = (0x01 << IIC_IF_RXOVF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxOvfStat()
* 功能说明: 获取IIC接收数据溢出中断状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  接收数据溢出   0  接收数据未溢出
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_IntRxOvfStat(IIC_TypeDef *IICx)
{	
	return (IICx->IF & IIC_IF_RXOVF_MSK) ? 1 : 0;		
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntTxFinishEn()
* 功能说明: IIC发送数据结束中断使能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntTxFinishEn(IIC_TypeDef *IICx)
{	
	IICx->IE |= (0x01 << IIC_IE_TXF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntTxFinishDis()
* 功能说明: IIC发送数据结束中断禁能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntTxFinishDis(IIC_TypeDef *IICx)
{	
	IICx->IE &= ~(0x01 << IIC_IE_TXF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntTxFinishClr()
* 功能说明: IIC发送数据结束中断状态清除
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntTxFinishClr(IIC_TypeDef *IICx)
{	
	IICx->IF = (0x01 << IIC_IF_TXF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntTxFinishStat()
* 功能说明: 获取IIC发送数据结束中断状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1 发送数据结束  0 发送数据未结束
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_IntTxFinishStat(IIC_TypeDef *IICx)
{	
	return (IICx->IF & IIC_IF_TXF_MSK) ? 1 : 0;		
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxFinishEn()
* 功能说明: IIC接收数据结束中断使能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntRxFinishEn(IIC_TypeDef *IICx)
{	
	IICx->IE |= (0x01 << IIC_IE_RXF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxFinishDis()
* 功能说明: IIC接收数据结束中断禁能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntRxFinishDis(IIC_TypeDef *IICx)
{	
	IICx->IE &= ~(0x01 << IIC_IE_RXF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxFinishClr()
* 功能说明: IIC接收数据结束中断状态清除
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntRxFinishClr(IIC_TypeDef *IICx)
{	
	IICx->IF = (0x01 << IIC_IF_RXF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntRxFinishStat()
* 功能说明: 获取IIC接收数据结束中断状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  接收数据结束   0  接收数据未结束
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_IntRxFinishStat(IIC_TypeDef *IICx)
{	
	return (IICx->IF & IIC_IF_RXF_MSK) ? 1 : 0;		
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStartEn()
* 功能说明: IIC从机检测到START信号中断使能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSlaveStartEn(IIC_TypeDef *IICx)
{	
	IICx->IE |= (0x01 << IIC_IE_SLV_STA_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStartDis()
* 功能说明: IIC从机检测到START信号中断禁能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSlaveStartDis(IIC_TypeDef *IICx)
{	
	IICx->IE &= ~(0x01 << IIC_IE_SLV_STA_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStartClr()
* 功能说明: IIC从机检测到START信号中断状态清除
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSlaveStartClr(IIC_TypeDef *IICx)
{	
	IICx->IF = (0x01 << IIC_IF_SLV_STA_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStartStat()
* 功能说明: 获取IIC从机检测到START信号中断状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  从机检测到START信号  0  从机未检测到START信号
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_IntSlaveStartStat(IIC_TypeDef *IICx)
{	
	return (IICx->IF & IIC_IF_SLV_STA_MSK) ? 1 : 0;		
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStopEn()
* 功能说明: IIC从机检测到STOP信号中断使能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSlaveStopEn(IIC_TypeDef *IICx)
{	
	IICx->IE |= (0x01 << IIC_IE_SLV_STO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStopDis()
* 功能说明: IIC从机检测到STOP信号中断禁能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSlaveStopDis(IIC_TypeDef *IICx)
{	
	IICx->IE &= ~(0x01 << IIC_IE_SLV_STO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStopClr()
* 功能说明: IIC从机检测到STOP信号中断状态清除
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSlaveStopClr(IIC_TypeDef *IICx)
{	
	IICx->IF = (0x01 << IIC_IF_SLV_STO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSlaveStopStat()
* 功能说明: 获取IIC从机检测到STOP信号中断状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  从机检测到STOP信号  0  从机未检测到STOP信号
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_IntSlaveStopStat(IIC_TypeDef *IICx)
{	
	return (IICx->IF & IIC_IF_SLV_STO_MSK) ? 1 : 0;		
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSclLowTimeOutEn()
* 功能说明: IIC主机模式下SCL低电平超时中断使能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSclLowTimeOutEn(IIC_TypeDef *IICx)
{	
	IICx->IE |= (0x01 << IIC_IE_MLTO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSclLowTimeOutDis()
* 功能说明: IIC主机模式下SCL低电平超时中断禁能
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSclLowTimeOutDis(IIC_TypeDef *IICx)
{	
	IICx->IE &= ~(0x01 << IIC_IE_MLTO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSclLowTimeOutClr()
* 功能说明: IIC主机模式下SCL低电平超时中断状态清除
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntSclLowTimeOutClr(IIC_TypeDef *IICx)
{	
	IICx->IF = (0x01 << IIC_IF_MLTO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntSclLowTimeOutStat()
* 功能说明: 获取IIC主机模式下SCL低电平超时中断状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  超时   0  未超时
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_IntSclLowTimeOutStat(IIC_TypeDef *IICx)
{	
	return (IICx->IF & IIC_IF_MLTO_MSK) ? 1 : 0;		
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Busy_State()
* 功能说明: 获取IIC总线忙状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  总线忙  0  总线不忙
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Busy_State(IIC_TypeDef *IICx)
{
	return (IICx->CST & IIC_CST_BUSY_MSK) ? 1 : 0;	
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_SCL_State()
* 功能说明: 获取IIC总线SCL电平状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  SCL高电平    0  SCL低电平
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_SCL_State(IIC_TypeDef *IICx)
{
	return (IICx->CST & IIC_CST_SCL_MSK) ? 1 : 0;	
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_SDA_State()
* 功能说明: 获取IIC总线SDA电平状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  SDA高电平    0  SDA低电平
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_SDA_State(IIC_TypeDef *IICx)
{
	return (IICx->CST & IIC_CST_SDA_MSK) ? 1 : 0;	
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Slave_Read_State()
* 功能说明: 获取IIC从机读状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  从机接收到主机的读请求   0  从机接收到主机的写请求或STOP信号
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Slave_Read_State(IIC_TypeDef *IICx)
{
	return (IICx->CST & IIC_CST_SLV_RD_MSK) ? 1 : 0;	
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Slave_Write_State()
* 功能说明: 获取IIC从机写状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  从机接收到主机的读请求   0  从机接收到主机的写请求或STOP信号
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Slave_Write_State(IIC_TypeDef *IICx)
{
	return (IICx->CST & IIC_CST_SLV_WR_MSK) ? 1 : 0;	
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Slave_Data_Type()
* 功能说明: 获取IIC从机接收到的数据类型
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  从机接收到主机的读请求   0  从机接收到主机的写请求或STOP信号
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Slave_Data_Type(IIC_TypeDef *IICx)
{
	return ((IICx->CST & IIC_CST_SLV_RXDT_MSK) >> IIC_CST_SLV_RXDT_POS);	
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_TXD_Clear()
* 功能说明: IIC发送数据寄存器清空
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_TXD_Clear(IIC_TypeDef *IICx)
{
	IICx->CTRANS |= (0x01 << IIC_CTRANS_TXD_CLR_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_TXD_Empty_State()
* 功能说明: 获取IIC发送数据寄存器空状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  发送数据寄存器空  0  发送数据寄存器非空
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_TXD_Empty_State(IIC_TypeDef *IICx)
{
	return (IICx->IF & IIC_IF_TXE_MSK) ? 1 : 0;	
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_RXD_NotEmpty_State()
* 功能说明: 获取IIC接收数据寄存器非空状态
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
* 输    出: 1  接收数据寄存器非空  0  接收数据寄存器空
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_RXD_NotEmpty_State(IIC_TypeDef *IICx)
{
	return (IICx->IF & IIC_IF_RXNE_MSK) ? 1 : 0;	
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Set_Addr7_Mask()
* 功能说明: IIC从机设置地址掩码
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
            uint8_t AddrMask   地址掩码
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Set_Addr7_Mask(IIC_TypeDef *IICx,uint8_t AddrMask)
{
	uint32_t temp = 0;
	
	temp = IICx->SADDR;
	
	temp &= ~(IIC_SADDR_MASK_ADDR1_7_MSK);
	temp |= (AddrMask << IIC_SADDR_MASK_ADDR1_7_POS);

	IICx->SADDR = temp;	
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_Set_Addr10_Mask()
* 功能说明: IIC从机设置地址掩码
* 输    入: IIC_TypeDef *IICx   IIC0  IIC1
            uint8_t AddrMask   地址掩码
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Set_Addr10_Mask(IIC_TypeDef *IICx,uint8_t AddrMask)
{
	uint32_t temp = 0;
	
	temp = IICx->SADDR;
	
	temp &= ~(0xFF << IIC_SADDR_MASK_ADDR0_POS);
	temp |= (AddrMask << IIC_SADDR_MASK_ADDR0_POS);	
	
	IICx->SADDR = temp;	
}


