#include "DP32G030_flash.h"


uint32_t Temp_Trim_Value = 0;

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Check_Init_Complete()
* 功能说明:	FLASH检查控制器初始化是否完成
* 输    入: 无   			
* 输    出: 1 :  FLASH控制器初始化完成  0: FLASH控制器初始化进行中
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t FLASH_Check_Init_Complete(void)
{
	if(FLASH->STATE & FLASH_STATE_INITBUSY_MSK)
	{
		return 0;
	}
	else
	{
		return 1;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Check_Busy()
* 功能说明:	FLASH检查控制器忙
* 输    入: 无   		
* 输    出: 1 :  FLASH控制器正在进行当前命令操作过程中 0: FLASH控制器处于READY状态，等待命令操作执行
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t FLASH_Check_Busy(void)
{
	if(FLASH->STATE & FLASH_STATE_BUSY_MSK)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Check_BufEmpty()
* 功能说明:	FLASH检查编程数据缓存寄存器是否为空
* 输    入: 无   	
* 输    出: 1 :  FLASH 编程数据缓存寄存器为空   0: FLASH 编程数据缓存寄存器不为空
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t FLASH_Check_BufEmpty(void)
{
	if(FLASH->STATE & FLASH_STATE_BUFEMPTY_MSK)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Set_DeepSleep_Mode()
* 功能说明:	FLASH进入深度睡眠模式，可以降低功耗
* 输    入: 无   	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Set_DeepSleep_Mode(void)
{
	FLASH->CFG |= ((uint32_t)0x01 << FLASH_CFG_DEEP_PD_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Set_Normal_Mode()
* 功能说明:	FLASH进入正常工作模式
* 输    入: 无   		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Set_Normal_Mode(void)
{
	FLASH->CFG &= ~((uint32_t)0x01 << FLASH_CFG_DEEP_PD_POS);
	while(FLASH_Check_Init_Complete() == 0);
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Set_ClkWait()
* 功能说明:	FLASH配置读速率模式时钟周期等待时间   0  1个系统时钟等待  1  2个系统时钟等待
* 输    入: uint8_t ClkWait   		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Set_ClkWait(uint8_t ClkWait)
{
	assert_param(IS_FLASH_CLK_WAIT(ClkWait));                   //检查输入的参数ClkWait是否合法      
	
	if(ClkWait == FLASH_ONE_CLK_WAIT)
	{
		FLASH->CFG &= ~(0x01 << FLASH_CFG_CLK_WAIT_POS);
	}
	else if(ClkWait == FLASH_TWO_CLK_WAIT)
	{
		FLASH->CFG |= 0x01 << FLASH_CFG_CLK_WAIT_POS;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Set_Array()
* 功能说明:	FLASH配置区域选择   0  MAIN ARRAY(64K)   1 NVR ARRAY(2K) 
* 输    入: uint8_t Array   		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Set_Array(uint8_t Array)
{
	uint32_t temp = 0;
	
	assert_param(IS_FLASH_ARRAY(Array));                       //检查输入的参数Array是否合法    
	
	temp = FLASH->CFG;
	
	temp &= ~(0x01 << FLASH_CFG_NVR_SEL_POS);
	temp |= Array << FLASH_CFG_NVR_SEL_POS;
	
	FLASH->CFG = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Set_Operate_Mode()
* 功能说明:	FLASH配置工作模式   0 读  1 写  2 扇区擦 3 全片擦 
* 输    入: uint8_t Mode   		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Set_Operate_Mode(uint8_t Mode)
{
	uint32_t temp = 0;
	
	assert_param(IS_FLASH_MODE(Mode));                         //检查输入的参数Mode是否合法    
	
	temp = FLASH->CFG;
	
	temp &= ~(0x07 << FLASH_CFG_MODE_POS);
	temp |= (Mode << FLASH_CFG_MODE_POS);
	
	FLASH->CFG = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Set_EraseTime()
* 功能说明:	FLASH配置擦除时间参数
* 输    入: 无 		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Set_EraseTime(void)
{
	FLASH->ERASETIME = ((CyclesPerUs*FLASH_TRCV_TIME)<<19) + CyclesPerUs*FLASH_TERASE_TIME;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Set_ProgramTime()
* 功能说明:	FLASH配置编程时间参数
* 输    入: 无 		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Set_ProgramTime(void)
{
	FLASH->PROGTIME = ((CyclesPerUs*FLASH_TPGS_TIME)<<11) + CyclesPerUs*FLASH_TPROG_TIME;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Operate_Lock()
* 功能说明:	FLASH上锁后不能进行FLASH编程
* 输    入: 无	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Operate_Lock(void)
{
	FLASH->LOCK = 0x55;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Operate_UnLock()
* 功能说明:	FLASH解锁后可以进行FLASH编程
* 输    入: 无	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Operate_UnLock(void)
{
	FLASH->UNLOCK = 0xAA;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Init()
* 功能说明:	FLASH初始化    
* 输    入: uint8_t ClkWait    	读速率模式时钟周期等待时间
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Init(uint8_t ClkWait)
{
	FLASH_Set_Normal_Mode();                      //FLASH进入正常工作模式 
	
	FLASH_Set_Operate_Mode(FLASH_MODE_READ);      //配置为读模式
	
	FLASH_Set_ClkWait(ClkWait);                   //FLASH配置读速率模式时钟周期等待时间   0  1个系统时钟等待  1  2个系统时钟等待  
	
	FLASH_Set_EraseTime();                        //FLASH配置擦除时间参数
	
	FLASH_Set_ProgramTime();                      //FLASH配置编程时间参数
	
	FLASH_Operate_Lock();                         //FLASH上锁后不能进行FLASH编程
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Command_Start()
* 功能说明:	FLASH解锁，命令启动
* 输    入: 无   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Command_Start(void)
{
	FLASH_Operate_UnLock();                         //FLASH解锁后可以进行FLASH编程
	
	FLASH->START |= 0x01 << FLASH_START_EN_POS;     //启动命令
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Mask_Lock()
* 功能说明:	FLASH MASK选择上锁后，不能进行屏蔽选择
* 输    入: 无	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Mask_Lock(void)
{
	FLASH->MASK |= 0x01 << FLASH_MASK_LOCK_POS;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Mask_UnLock()
* 功能说明:	FLASH MASK解锁后可以进行屏蔽选择
* 输    入: 无	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Mask_UnLock(void)
{
	FLASH->MASK &= ~(0x01 << FLASH_MASK_LOCK_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Mask_Sel()
* 功能说明:	FLASH MASK扇区选择   0 无屏蔽  1 2KB屏蔽   2  4KB屏蔽   3  8KB屏蔽
* 输    入: uint8_t Mask_Sel
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Mask_Sel(uint8_t Mask_Sel)
{
	uint32_t temp = 0;
	
	assert_param(IS_FLASH_MAIN_MASK(Mask_Sel));         //检查输入的参数Mask_Sel是否合法    
	
	temp = FLASH->MASK;
	
	temp &= ~(0x03 << FLASH_MASK_SEL_POS);       
	temp |= Mask_Sel << FLASH_MASK_SEL_POS;
	
	FLASH->MASK = temp;
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Unlock_Lock()
* 功能说明:	FLASH解锁，执行命令，等待完成，返回读操作，上锁
* 输    入: uint32_t addr	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Unlock_Lock(void)
{
	FLASH_Command_Start();                                    //FLASH解锁，命令启动
	
	while(FLASH_Check_Busy());                                //FLASH检查控制器忙
	
	FLASH_Set_Operate_Mode(FLASH_MODE_READ);                  //配置为读模式
	
	FLASH_Operate_Lock();                                     //FLASH上锁后不能进行FLASH编程 
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Sector_Erase()
* 功能说明:	FLASH扇区擦   一个扇区512字节  输入的地址参数最好是512的整数倍
* 输    入: uint32_t addr	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Sector_Erase(uint32_t addr)
{
	__disable_irq();
	
	while(FLASH_Check_Busy());                                //FLASH检查控制器忙

	FLASH_Set_Operate_Mode(FLASH_MODE_SECTOR_ERASE);          //扇区擦

	FLASH->ADDR = addr>>2;                                    //地址转换为以字为单位
	
	FLASH_Unlock_Lock();	                                  //FLASH解锁，执行命令，等待完成，返回读操作，上锁
	
	__enable_irq();
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Write_Word()
* 功能说明:	FLASH编程一个字
* 输    入: uint32_t addr   要写入的地址
*           uint32_t data   要写入的数据
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Write_Word(uint32_t addr,uint32_t data)
{
	__disable_irq();
	
	while(FLASH_Check_Busy());                                //FLASH检查控制器忙

	FLASH_Set_Operate_Mode(FLASH_MODE_WRITE);                 //写命令
	
	FLASH->ADDR = addr>>2;                                    //地址转换为以字为单位
	
	FLASH->WDATA = data;                                      //将数据放到写数据寄存器中
	
	FLASH_Unlock_Lock();	                                  //FLASH解锁，执行命令，等待完成，返回读操作，上锁
	
	__enable_irq();
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Write_Words()
* 功能说明:	FLASH编程多个字
* 输    入: uint32_t addr     要写入的地址
*           uint32_t data[]   要写入的数据
*           uint8_t num       要写入的数量 不能超过64个字   单位为字
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t FLASH_Write_Words(uint32_t addr,uint32_t data[],uint8_t num)
{
	uint32_t i = 0;
	
	__disable_irq();
	
	if(num > 64 || ((((addr%256) >>2)+ num) > 64))
	{
		return 1;
	}
	
	while(FLASH_Check_Busy());                     //FLASH检查控制器忙
	
	FLASH_Set_Operate_Mode(FLASH_MODE_WRITE);      //写命令
	
	FLASH->ADDR = addr>>2;                         //地址转换为以字为单位
	
	FLASH->WDATA = data[0];                        //将数据放到写数据寄存器中
	
	FLASH_Command_Start();                         //FLASH解锁，命令启动
	
	for(i = 1;i < num;i++)
	{
		while(FLASH_Check_BufEmpty() == 0);        //等待FLASH编程数据缓存寄存器为空
		
		FLASH->WDATA = data[i];                    //将数据放到写数据寄存器中
	}
	
	while(FLASH_Check_Busy());                     //FLASH检查控制器忙

	FLASH_Set_Operate_Mode(FLASH_MODE_READ);       //配置为读模式
	
	FLASH_Operate_Lock();                          //FLASH上锁后不能进行FLASH编程 
	
	__enable_irq();
	
	return 0;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Recall_Read()
* 功能说明:	FLASH RECALL读数据
* 输    入: uint32_t addr   要写入的地址
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t FLASH_Recall_Read(uint32_t addr)
{
	uint32_t data = 0;
	
	__disable_irq();
	
	while(FLASH_Check_Busy());                                //FLASH检查控制器忙

	FLASH_Set_Operate_Mode(FLASH_MODE_RECALL_READ);           //RECALL读命令
	
	FLASH->ADDR = (addr>>2);                                  //地址转换为以字为单位
	
	FLASH_Command_Start();                                    //FLASH解锁，命令启动
	
	while(FLASH_Check_Busy());                                //FLASH检查控制器忙

	data = FLASH->RDATA;                                      //读取数据
	
	FLASH_Set_Operate_Mode(FLASH_MODE_READ);                  //配置为读模式
	
	FLASH_Operate_Lock();                                     //FLASH上锁后不能进行FLASH编程 
	
	__enable_irq();
	
	return data;
}

/****************************************************************************************************************************************** 
* 函数名称: FLASH_Read_Word()
* 功能说明:	FLASH读单个字  
* 输    入: uint32_t addr  地址			
* 输    出: 读到的数据
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t FLASH_Read_Word(uint32_t addr)
{
	addr = (addr>>2)<<2;                          //地址字对齐
	
	return *((volatile unsigned int *)(addr));    //读取该地址的数据
}


/****************************************************************************************************************************************** 
* 函数名称: FLASH_Read_Words()
* 功能说明:	FLASH读多个字  
* 输    入: uint32_t addr    地址	
*           uint32_t num     长度个数
* 输    出: uint32_t data[]  读到的数据  
* 注意事项: 无
******************************************************************************************************************************************/
void FLASH_Read_Words(uint32_t addr,uint32_t data[],uint32_t num)
{
	uint32_t i = 0;
	
	addr = (addr>>2)<<2;                                       //地址字对齐 
	
	for(i = 0;i < num;i++)
	{
		data[i] = *((volatile unsigned int *)(addr + i*4));    //读取该地址的数据
	}
}

/****************************************************************************************************************************************** 
* 函数名称: Read_Trim_Value_From_Flash()
* 功能说明:	从NVR区读取TRIM值写入相应寄存器
* 输    入: 无		
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void Read_Trim_Value_From_Flash(void)
{
	uint32_t data = 0;
	
	FLASH_Set_Array(FLASH_NVR_ARRAY);                                     //将FLASH区域配置为NVR区
	
	SYS->CHIPID0 = FLASH_Recall_Read(FLASH_CHIPID0_ADDR);                 //从NVR区对应地址读取CHIPID0写入相应寄存器
	
	SYS->CHIPID1 = FLASH_Recall_Read(FLASH_CHIPID1_ADDR);                 //从NVR区对应地址读取CHIPID1写入相应寄存器
	
	SYS->CHIPID2 = FLASH_Recall_Read(FLASH_CHIPID2_ADDR);                 //从NVR区对应地址读取CHIPID2写入相应寄存器
	
	SYS->CHIPID3 = FLASH_Recall_Read(FLASH_CHIPID3_ADDR);                 //从NVR区对应地址读取CHIPID3写入相应寄存器
	
	SYS->RC_FREQ_DELTA = FLASH_Read_Word(FLASH_FREQ_DELTA_ADDR);          //从NVR区对应地址读取时钟差值写入相应寄存器
	
	SYS->VREF_VOLT_DELTA = FLASH_Read_Word(FLASH_VREF_DELTA_ADDR);        //从NVR区对应地址读取VREF电压差值写入相应寄存器 
	
	PMU->TRIM_POW0 = FLASH_Read_Word(FLASH_TRIM_PWR0_ADDR);               //从NVR区对应地址读取电压TRIM值写入相应寄存器
	
	PMU->TRIM_POW1 = FLASH_Read_Word(FLASH_TRIM_PWR1_ADDR);               //从NVR区对应地址读取电压TRIM值写入相应寄存器
	
	PMU->TRIM_RCHF = FLASH_Read_Word(FLASH_TRIM_RCHF_ADDR);               //从NVR区对应地址读取内部高频TRIM值写入相应寄存器
	
	PMU->TRIM_RCLF = FLASH_Read_Word(FLASH_TRIM_RCLF_ADDR);               //从NVR区对应地址读取内部低频TRIM值写入相应寄存器
	
	PMU->TRIM_OPA = FLASH_Read_Word(FLASH_TRIM_OPA_ADDR);                 //从NVR区对应地址读取运放TRIM值写入相应寄存器
	
	PMU->TRIM_PLL = FLASH_Read_Word(FLASH_TRIM_PLLRES_ADDR);              //从NVR区对应地址读取PLL电阻TRIM值写入相应寄存器
	
	Temp_Trim_Value = FLASH_Read_Word(FLASH_TRIM_TEMP_ADDR);              //从NVR区对应地址读取温度传感器校准值写入相应寄存器
	
	data = FLASH_Read_Word(FLASH_TRIM_ADC_ADDR);                          //从NVR区对应地址读取ADC模块TRIM值写入相应寄存器
	
	SYS->CLKEN |= 0x01 << SYS_CLKEN_ADC_POS;                              //打开ADC的时钟
	
	ADC->CALIB_OFFSET = data & 0xFF;                                      //写入OFFSET寄存器
	
	ADC->CALIB_KD = (data >> 16) & 0x3FF;                                 //写入KD寄存器 
	
	FLASH_Set_Array(FLASH_MAIN_ARRAY);                                    //将FLASH区域配置为MAIN区
}


