#include "DP32G030_wwdt.h"


/****************************************************************************************************************************************** 
* 函数名称:	WWDT_Init()
* 功能说明:	WWDT看门狗初始化
* 输    入: WWDT_InitTypeDef * WWDT_InitStruct
*			
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_Init(WWDT_InitTypeDef * WWDT_InitStruct)
{
	uint32_t temp = 0;
	
	assert_param(IS_WWDT_CLKDIV(WWDT_InitStruct->ClkDiv));             //检查输入的参数ClkDiv是否合法     
	
	assert_param(IS_WWDT_INTLOAD(WWDT_InitStruct->Int_Load));          //检查输入的参数Int_Load是否合法     
	
	assert_param(IS_WWDT_RSTLOAD(WWDT_InitStruct->Rst_Load));          //检查输入的参数Rst_Load是否合法     
	
	assert_param(IS_INT_EN(WWDT_InitStruct->IntEn));                   //检查输入的参数IntEn是否合法     
	
	assert_param(IS_PREINT_EN(WWDT_InitStruct->PresetIntEn));          //检查输入的参数PresetIntEn是否合法     
	
	
	SYS->CLKEN |= 0x01 << SYS_CLKEN_WWDT_POS;                          //WWDT时钟使能
	
	WWDT_Stop();                                                       //关闭WWDT
	
	temp = WWDT->CTRL;
	
	temp &= ~(0x03 << WWDT_CTRL_CLKDIV_POS);
	temp |= (WWDT_InitStruct->ClkDiv << WWDT_CTRL_CLKDIV_POS);                     //时钟预分频
	
	temp &= ~(0x01 << WWDT_CTRL_INTEN_POS);
	temp |= (WWDT_InitStruct->IntEn << WWDT_CTRL_INTEN_POS);                       //窗口中断使能选择
	
	temp &= ~(0x01 << WWDT_CTRL_PRESETINTEN_POS);
	temp |= (WWDT_InitStruct->PresetIntEn << WWDT_CTRL_PRESETINTEN_POS);           //预复位中断使能选择

    WWDT->CTRL = temp;

	WWDT->LOAD = (WWDT_InitStruct->Int_Load + (WWDT_InitStruct->Rst_Load << 8));   //填充WWDT初始值

	if(WWDT_InitStruct->IntEn == ENABLE || WWDT_InitStruct->PresetIntEn == ENABLE)
	{
		NVIC_EnableIRQ(WWDT_IRQn);                                    //开启WWDT中断
	}
}


/****************************************************************************************************************************************** 
* 函数名称:	WWDT_Start()
* 功能说明:	启动指定WWDT，开始倒计时
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_Start(void)
{
	WWDT->CTRL |= (0x01 << WWDT_CTRL_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_Stop()
* 功能说明:	关闭指定WWDT，停止倒计时
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_Stop(void)
{
	IWDT->CTRL &= ~(0x01 << WWDT_CTRL_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	WWDT_Feed()
* 功能说明:	喂狗操作
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_Feed(void)
{
	WWDT->FEED = 0x55;
}


/****************************************************************************************************************************************** 
* 函数名称:	WWDT_Read()
* 功能说明:	读取WWDT当前计数值
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t WWDT_Read(void)
{
	return WWDT->VALUE;
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_INT_Enable()
* 功能说明:	WWDT窗口中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_INT_Enable(void)
{
	WWDT->CTRL |= (0x01 << WWDT_CTRL_INTEN_POS);     //中断使能
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_INT_Disable()
* 功能说明:	WWDT窗口中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_INT_Disable(void)
{
	WWDT->CTRL &= ~(0x01 << WWDT_CTRL_INTEN_POS);     //中断禁能
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_INTStat()
* 功能说明:	WWDT窗口中断状态查询
* 输    入: 无
* 输    出: uint8_t		1 发生中断溢出    0 未发生中断溢出
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t WWDT_INTStat(void)
{
	if((WWDT->IF & WWDT_IF_WININT_MSK))
	{
		return 1;
	}
	else
	{
		return 0;
	}
}


/****************************************************************************************************************************************** 
* 函数名称:	WWDT_INTClr()
* 功能说明:	WWDT窗口中断标志清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_INTClr(void)
{
	WWDT->IF = (0x01 << WWDT_IF_WININT_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_PRESETINT_Enable()
* 功能说明:	WWDT预复位中断使能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_PRESETINT_Enable(void)
{
	WWDT->CTRL |= (0x01 << WWDT_CTRL_PRESETINTEN_POS);     //中断使能
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_PRESETINT_Disable()
* 功能说明:	WWDT预复位中断禁能
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_PRESETINT_Disable(void)
{
	WWDT->CTRL &= ~(0x01 << WWDT_CTRL_PRESETINTEN_POS);     //中断禁能
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_PRESETINTStat()
* 功能说明:	WWDT预复位中断状态查询
* 输    入: 无
* 输    出: uint8_t		1 发生中断溢出    0 未发生中断溢出
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t WWDT_PRESETINTStat(void)
{
	if((WWDT->IF & WWDT_IF_PRESETINT_MSK))
	{
		return 1;
	}
	else
	{
		return 0;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	WWDT_PRESETINTClr()
* 功能说明:	WWDT预复位中断标志清除
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WWDT_PRESETINTClr(void)
{
	WWDT->IF = (0x01 << WWDT_IF_PRESETINT_POS);
}


