#include "DP32G030_uart.h"

/****************************************************************************************************************************************** 
* 函数名称: UART_Init()
* 功能说明:	串口初始化，包含串口号  波特率  数据长度   校验位   停止位   中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
*			UART_InitTypeDef * UART_InitStruct
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Init(UART_TypeDef * UARTx, UART_InitTypeDef * UART_InitStruct)	
{
	uint32_t temp = 0,Baudrate_Set = 0;
	
	assert_param(IS_UART_ALL(UARTx));                                           //检查输入的参数UARTx是否合法      
	
	assert_param(IS_UART_DATABITS(UART_InitStruct->DataBits));                  //检查输入的参数DataBits是否合法      
	
	assert_param(IS_UART_PARITY(UART_InitStruct->Parity));                      //检查输入的参数Parity是否合法      
	
	assert_param(IS_UART_AUTOBAUD_LEN(UART_InitStruct->AutoBaud_Len));          //检查输入的参数AutoBaud_Len是否合法      
	
	assert_param(IS_UART_CTS_POL(UART_InitStruct->CTS_Pol));                    //检查输入的参数CTS_Pol是否合法      
	
	assert_param(IS_UART_RTS_POL(UART_InitStruct->RTS_Pol));                    //检查输入的参数RTS_Pol是否合法      
	
	assert_param(IS_UART_TXFIFO_LEVEL(UART_InitStruct->TXFIFO_Level));          //检查输入的参数TXFIFO_Level是否合法      
	
	assert_param(IS_UART_RXFIFO_LEVEL(UART_InitStruct->RXFIFO_Level));          //检查输入的参数RXFIFO_Level是否合法      
	
	
	switch((uint32_t)UARTx)
	{
		case ((uint32_t)UART0):
			SYS->CLKEN |= 0x01 << SYS_CLKEN_UART0_POS;        //打开串口0的时钟
		break;
		
		case ((uint32_t)UART1):
			SYS->CLKEN |= 0x01 << SYS_CLKEN_UART1_POS;        //打开串口1的时钟
		break;
		
		case ((uint32_t)UART2):
			SYS->CLKEN |= 0x01 << SYS_CLKEN_UART2_POS;        //打开串口2的时钟
		break;
	}
	
	UART_Close(UARTx);                //关闭串口
	
	if((SystemCoreClock%UART_InitStruct->Baudrate)*1.0/UART_InitStruct->Baudrate > 0.5)
	{
		Baudrate_Set = (SystemCoreClock/UART_InitStruct->Baudrate) + 1;
	}
	else
	{
		Baudrate_Set = (SystemCoreClock/UART_InitStruct->Baudrate);
	}
	
	UARTx->BAUD = Baudrate_Set;      //配置波特率
	
	temp = 0x00;
	
	temp |= (UART_InitStruct->DataBits << UART_CTRL_NINEBIT_POS) |     //配置数据长度
			(UART_InitStruct->Parity   << UART_CTRL_PARITY_POS);       //配置校验位
	
	temp |= UART_InitStruct->RX_Enable << UART_CTRL_RXEN_POS;          //接收使能配置

	temp |= UART_InitStruct->TX_Enable << UART_CTRL_TXEN_POS;          //发送使能配置
	
	temp |= UART_InitStruct->RX_DMAEnable << UART_CTRL_RXDMAEN_POS;    //接收DMA使能配置
	
	temp |= UART_InitStruct->AutoBaud_Enable << UART_CTRL_ABRDEN_POS;  //自动检测波特率使能配置
	
	temp |= UART_InitStruct->AutoBaud_Len << UART_CTRL_ABRDBIT_POS;    //自动检测波特率检测位长配置
	
	UARTx->CTRL = temp;
	
	UARTx->RXTO = UART_InitStruct->Rx_TimeOut;                                //接收超时时间设置
	
	temp = 0x00;
	
	temp |= UART_InitStruct->CTS_Enable << UART_FC_CTS_EN_POS;           //CTS流控使能配置
	
	temp |= UART_InitStruct->RTS_Enable << UART_FC_RTS_EN_POS;           //RTS流控使能配置

	temp |= UART_InitStruct->CTS_Pol << UART_FC_CTS_POL_POS;             //CTS信号极性配置
	
	temp |= UART_InitStruct->RTS_Pol << UART_FC_RTS_POL_POS;             //RTS信号极性配置
	
	UARTx->FC = temp;
	
	temp = 0x00;
	
	temp |= UART_InitStruct->TXFIFO_Level << UART_FIFO_TF_LEVEL_POS;   //发送FIFO产生中断的水位配置

	temp |= UART_InitStruct->RXFIFO_Level << UART_FIFO_RF_LEVEL_POS;   //接收FIFO产生中断的水位配置

	temp |= UART_InitStruct->TXFIFO_Clr_Enable << UART_FIFO_TF_CLR_POS;//发送FIFO清除使能配置

	temp |= UART_InitStruct->RXFIFO_Clr_Enable << UART_FIFO_RF_CLR_POS;//接收FIFO清除使能配置
	
	UARTx->FIFO = temp;
	
	temp = 0x00;                                                         //中断全部禁能
	
	temp |= UART_InitStruct->TX_DONE_IE << UART_IE_TXDONE_POS;           //数据全部发送完成中断使能配置
	
	temp |= UART_InitStruct->PARITY_ERROR_IE << UART_IE_PARITYE_POS;     //接收数据出现奇偶校验错误中断使能配置
	
	temp |= UART_InitStruct->STOP_ERROR_IE << UART_IE_STOPE_POS;         //接收数据出现停止位错误中断使能配置
	
	temp |= UART_InitStruct->RX_TIMEOUT_IE << UART_IE_RXTO_POS;          //接收超时中断使能配置
	
	temp |= UART_InitStruct->RXFIFO_LEVEL_IE << UART_IE_RXFIFO_POS;      //接收FIFO中接收的数据达到了设定的水位中断使能配置
	
	temp |= UART_InitStruct->TXFIFO_LEVEL_IE << UART_IE_TXFIFO_POS;      //发送FIFO中接收的数据达到了设定的水位中断使能配置
	
	temp |= UART_InitStruct->RXFIFO_OVF_IE << UART_IE_RXFIFO_OVF_POS;    //接收FIFO溢出中断使能配置
	
	temp |= UART_InitStruct->AUTOBAUD_OVF_IE << UART_IE_ABRD_OVF_POS;    //自动波特率检测计数器溢出中断使能配置
	
	UARTx->IE = temp;
	
	if(UARTx->IE != 0)
	{
		switch((uint32_t)UARTx)         
		{
			case ((uint32_t)UART0):		

				NVIC_EnableIRQ(UART0_IRQn);        //使能串口0中断   
				
			break;
			
			case ((uint32_t)UART1):		

				NVIC_EnableIRQ(UART1_IRQn);        //使能串口1中断   
				
			break;
			
			case ((uint32_t)UART2):		

				NVIC_EnableIRQ(UART2_IRQn);        //使能串口2中断   
				
			break;
		}
	}
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Open()
* 功能说明:	串口打开 
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Open(UART_TypeDef * UARTx)
{
	UARTx->CTRL |= (0x01 << UART_CTRL_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Close()
* 功能说明:	串口关闭  
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Close(UART_TypeDef * UARTx)
{
	UARTx->CTRL &= ~(0x01 << UART_CTRL_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Set_BaudRate()
* 功能说明:	串口设置波特率
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
            uint32_t BaudRate    设置的波特率
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_BaudRate(UART_TypeDef * UARTx,uint32_t BaudRate)
{
	uint32_t BaudRate_Set = 0;

	if((SystemCoreClock%BaudRate)*1.0/BaudRate > 0.5)
	{
		BaudRate_Set = (SystemCoreClock/BaudRate) + 1;
	}
	else
	{
		BaudRate_Set = (SystemCoreClock/BaudRate);
	}
	
	UARTx->BAUD = BaudRate_Set;      //配置波特率
}


/****************************************************************************************************************************************** 
* 函数名称: UART_TX_Enable()
* 功能说明:	串口发送使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_TX_Enable(UART_TypeDef * UARTx)
{
	UARTx->CTRL |= (0x01 << UART_CTRL_TXEN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_TX_Disable()
* 功能说明:	串口发送禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_TX_Disable(UART_TypeDef * UARTx)
{
	UARTx->CTRL &= ~(0x01 << UART_CTRL_TXEN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: UART_RX_Enable()
* 功能说明:	串口接收使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_RX_Enable(UART_TypeDef * UARTx)
{
	UARTx->CTRL |= (0x01 << UART_CTRL_RXEN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_RX_Disable()
* 功能说明:	串口接收禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_RX_Disable(UART_TypeDef * UARTx)
{
	UARTx->CTRL &= ~(0x01 << UART_CTRL_RXEN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_RXDMA_Enable()
* 功能说明:	串口接收DMA传输使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_RXDMA_Enable(UART_TypeDef * UARTx)
{
	UARTx->CTRL |= (0x01 << UART_CTRL_RXDMAEN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_RXDMA_Disable()
* 功能说明:	串口接收DMA传输禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_RXDMA_Disable(UART_TypeDef * UARTx)
{
	UARTx->CTRL &= ~(0x01 << UART_CTRL_RXDMAEN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_AutoBaud_Enable()
* 功能说明:	串口自动波特率检测使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_AutoBaud_Enable(UART_TypeDef * UARTx)
{
	UARTx->CTRL |= (0x01 << UART_CTRL_ABRDEN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_AutoBaud_Disable()
* 功能说明:	串口自动波特率检测禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_AutoBaud_Disable(UART_TypeDef * UARTx)
{
	UARTx->CTRL &= ~(0x01 << UART_CTRL_ABRDEN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Set_AutoBaud_Len()
* 功能说明:	串口自动波特率检测位长设置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
            AutoBaud_Len_TypeDef AutoBaud_Len    检测位长设置
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_AutoBaud_Len(UART_TypeDef * UARTx,AutoBaud_Len_TypeDef AutoBaud_Len)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x03 << UART_CTRL_ABRDBIT_POS);
	temp |= (AutoBaud_Len << UART_CTRL_ABRDBIT_POS);
	
	UARTx->CTRL = temp;
}

/****************************************************************************************************************************************** 
* 函数名称: UART_AutoBaud_Finished_Check()
* 功能说明:	串口自动波特率检测完成状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  自动波特率完成检测功能  0  自动波特率未完成检测功能
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_AutoBaud_Finished_Check(UART_TypeDef * UARTx)
{
	while(UARTx->CTRL & (0x01 << UART_CTRL_ABRDEN_POS))
	{
		if(UART_IntAutoBaudOvfState(UARTx))
		{
			return 0;
		}
	}
	
	return 1;
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Set_RX_TimeOut()
* 功能说明:	串口接收数据超时时间配置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
            uint8_t RX_TimeOut       接收数据超时时间配置
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_RX_TimeOut(UART_TypeDef * UARTx,uint8_t RX_TimeOut)
{
	UARTx->RXTO = (RX_TimeOut << UART_RXTO_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_CTS_Enable()
* 功能说明:	串口CTS流控使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_CTS_Enable(UART_TypeDef * UARTx)
{
	UARTx->FC |= (0x01 << UART_FC_CTS_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_CTS_Disable()
* 功能说明:	串口CTS流控禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_CTS_Disable(UART_TypeDef * UARTx)
{
	UARTx->FC &= ~(0x01 << UART_FC_CTS_EN_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: UART_RTS_Enable()
* 功能说明:	串口RTS流控使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_RTS_Enable(UART_TypeDef * UARTx)
{
	UARTx->FC |= (0x01 << UART_FC_RTS_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_RTS_Disable()
* 功能说明:	串口RTS流控禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_RTS_Disable(UART_TypeDef * UARTx)
{
	UARTx->FC &= ~(0x01 << UART_FC_RTS_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Set_CTS_Pol()
* 功能说明:	串口CTS信号极性设置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
		    CTS_Pol_TypeDef   CTS_Pol    
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_CTS_Pol(UART_TypeDef * UARTx,CTS_Pol_TypeDef   CTS_Pol)
{
	UARTx->FC &= ~(0x01 << UART_FC_CTS_POL_POS);
	UARTx->FC |= (CTS_Pol << UART_FC_CTS_POL_POS);
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Set_RTS_Pol()
* 功能说明:	串口RTS信号极性设置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
		    RTS_Pol_TypeDef   RTS_Pol    
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_RTS_Pol(UART_TypeDef * UARTx,RTS_Pol_TypeDef RTS_Pol)
{
	UARTx->FC &= ~(0x01 << UART_FC_RTS_POL_POS);
	UARTx->FC |= (RTS_Pol << UART_FC_RTS_POL_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: UART_Get_CTS_Pol()
* 功能说明:	获取串口CTS信号极性
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2  
* 输    出: 1  高电平  0  低电平
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_Get_CTS_Pol(UART_TypeDef * UARTx)
{
	return (UARTx->FC & UART_FC_CTS_SIGNAL_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Get_RTS_Pol()
* 功能说明:	获取串口RTS信号极性
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2   
* 输    出: 1  高电平  0  低电平
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_Get_RTS_Pol(UART_TypeDef * UARTx)
{
	return (UARTx->FC & UART_FC_RTS_SIGNAL_MSK) ? 1 : 0;
}



/****************************************************************************************************************************************** 
* 函数名称: UART_Set_TXFIFO_Level()
* 功能说明:	串口发送FIFO水位设置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
		    TXFIFO_Level_TypeDef  TXFIFO_Level   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_TXFIFO_Level(UART_TypeDef * UARTx,TXFIFO_Level_TypeDef  TXFIFO_Level)
{
	uint32_t temp = 0;
	
	temp = UARTx->FIFO;
	
	temp &= ~(0x07 << UART_FIFO_TF_LEVEL_POS);
	temp |= (TXFIFO_Level << UART_FIFO_TF_LEVEL_POS);
	
	UARTx->FIFO = temp;
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Set_RXFIFO_Level()
* 功能说明:	串口接收FIFO水位设置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
		    RXFIFO_Level_TypeDef  RXFIFO_Level   
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_RXFIFO_Level(UART_TypeDef * UARTx,RXFIFO_Level_TypeDef  RXFIFO_Level)
{
	uint32_t temp = 0;
	
	temp = UARTx->FIFO;
	
	temp &= ~(0x07 << UART_FIFO_RF_LEVEL_POS);
	temp |= (RXFIFO_Level << UART_FIFO_RF_LEVEL_POS);
	
	UARTx->FIFO = temp;
}


/****************************************************************************************************************************************** 
* 函数名称: UART_Set_TXFIFO_Clr()
* 功能说明:	串口发送FIFO清除使能设置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2 
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_TXFIFO_Clr(UART_TypeDef * UARTx)
{
	UARTx->FIFO |= (0x01 << UART_FIFO_TF_CLR_POS);
}

/****************************************************************************************************************************************** 
* 函数名称: UART_Set_RXFIFO_Clr()
* 功能说明:	串口接收FIFO清除使能设置
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2  
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Set_RXFIFO_Clr(UART_TypeDef * UARTx)
{
	UARTx->FIFO |= (0x01 << UART_FIFO_RF_CLR_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTxDoneEn()
* 功能说明:	串口数据全部发送完成中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntTxDoneEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_TXDONE_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTxDoneDis()
* 功能说明:	串口数据全部发送完成中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntTxDoneDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_TXDONE_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTxDoneClr()
* 功能说明:	串口数据全部发送完成中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntTxDoneClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_TXDONE_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTxDoneState()
* 功能说明:	串口数据全部发送完成中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  数据发送完成  0  数据发送没有完成
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntTxDoneState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_TXDONE_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntParityErrorEn()
* 功能说明:	串口接收数据出现奇偶校验错误中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntParityErrorEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_PARITYE_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntParityErrorDis()
* 功能说明:	串口接收数据出现奇偶校验错误中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntParityErrorDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_PARITYE_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntParityErrorClr()
* 功能说明:	串口接收数据出现奇偶校验错误中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntParityErrorClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_PARITYE_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntParityErrorState()
* 功能说明:	串口接收数据出现奇偶校验错误中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  接收数据出现奇偶校验错误  0  接收数据没有出现奇偶校验错误
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntParityErrorState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_PARITYE_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntStopErrorEn()
* 功能说明:	串口接收数据出现停止位错误中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntStopErrorEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_STOPE_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntStopErrorDis()
* 功能说明:	串口接收数据出现停止位错误中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntStopErrorDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_STOPE_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntStopErrorClr()
* 功能说明:	串口接收数据出现停止位错误中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntStopErrorClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_STOPE_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntStopErrorState()
* 功能说明:	串口接收数据出现停止位错误中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  接收数据出现停止位错误  0 接收数据没有出现停止位错误
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntStopErrorState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_STOPE_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRxTimeOutEn()
* 功能说明:	串口数据接收超时中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRxTimeOutEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_RXTO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRxTimeOutDis()
* 功能说明:	串口数据接收超时中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRxTimeOutDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_RXTO_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRxTimeOutClr()
* 功能说明:	串口数据接收超时中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRxTimeOutClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_RXTO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRxTimeOutState()
* 功能说明:	串口数据接收超时中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  数据接收超时  0  数据接收没有超时
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntRxTimeOutState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_RXTO_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOLevelEn()
* 功能说明:	串口接收FIFO中接收到的数据达到设定水位中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRXFIFOLevelEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_RXFIFO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOLevelDis()
* 功能说明:	串口接收FIFO中接收到的数据达到设定水位中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRXFIFOLevelDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_RXFIFO_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOLevelClr()
* 功能说明:	串口接收FIFO中接收到的数据达到设定水位中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRXFIFOLevelClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_RXFIFO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOLevelState()
* 功能说明:	串口接收FIFO中接收到的数据达到设定水位中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1 接收FIFO中接收到的数据达到设定水位  0 接收FIFO中接收到的数据没有达到设定水位
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntRXFIFOLevelState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_RXFIFO_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTXFIFOLevelEn()
* 功能说明:	串口发送FIFO中待发送的数据个数不多于设置值中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntTXFIFOLevelEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_TXFIFO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTXFIFOLevelDis()
* 功能说明:	串口发送FIFO中待发送的数据个数不多于设置值中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntTXFIFOLevelDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_TXFIFO_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTXFIFOLevelClr()
* 功能说明:	串口发送FIFO中待发送的数据个数不多于设置值中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntTXFIFOLevelClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_TXFIFO_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntTXFIFOLevelState()
* 功能说明:	串口发送FIFO中待发送的数据个数不多于设置值中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  发送FIFO中待发送的数据个数不多于设置值  0  发送FIFO中待发送的数据个数多于设置值
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntTXFIFOLevelState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_TXFIFO_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOOvfEn()
* 功能说明:	串口接收FIFO溢出中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRXFIFOOvfEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_RXFIFO_OVF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOOvfDis()
* 功能说明:	串口接收FIFO溢出中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRXFIFOOvfDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_RXFIFO_OVF_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOOvfClr()
* 功能说明:	串口接收FIFO溢出中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntRXFIFOOvfClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_RXFIFO_OVF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntRXFIFOOvfState()
* 功能说明:	串口接收FIFO溢出中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  接收FIFO溢出  0 接收FIFO未溢出
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntRXFIFOOvfState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_RXFIFO_OVF_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntAutoBaudOvfEn()
* 功能说明:	串口自动波特率检测功能计数器溢出中断使能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntAutoBaudOvfEn(UART_TypeDef * UARTx)
{
	UARTx->IE |= (0x01 << UART_IE_ABRD_OVF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntAutoBaudOvfDis()
* 功能说明:	串口自动波特率检测功能计数器溢出中断禁能
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntAutoBaudOvfDis(UART_TypeDef * UARTx)
{
	UARTx->IE &= ~(0x01 << UART_IE_ABRD_OVF_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_IntAutoBaudOvfClr()
* 功能说明:	串口自动波特率检测功能计数器溢出中断标志清除
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_IntAutoBaudOvfClr(UART_TypeDef * UARTx)
{
	UARTx->IF = (0x01 << UART_IF_ABRD_OVF_POS);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_IntAutoBaudOvfState()
* 功能说明:	串口自动波特率检测功能计数器溢出中断状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  计数器溢出，检测失败  0 计数器未溢出，检测成功
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_IntAutoBaudOvfState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_ABRD_OVF_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称: UART_SendData()
* 功能说明:	串口发送函数   
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
*			uint16_t data    待发送的数据
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_SendData(UART_TypeDef * UARTx, uint16_t data)
{
	UARTx->TDR = data;
}

/****************************************************************************************************************************************** 
* 函数名称: UART_ReceiveData()
* 功能说明:	串口接收函数  
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2	   
* 输    出: 接收到的数据 
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t UART_ReceiveData(UART_TypeDef * UARTx)
{
	return (UARTx->RDR & 0x1FF);	
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_RXFIFOEmptyState()
* 功能说明:	串口接收FIFO空状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  接收FIFO空 0  接收FIFO非空
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_RXFIFOEmptyState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_RXFIFO_EMPTY_MSK) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_RXFIFOFullState()
* 功能说明:	串口接收FIFO满状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  接收FIFO满  0  接收FIFO没有满
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_RXFIFOFullState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_RXFIFO_FULL_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_RXFIFOHalfFullState()
* 功能说明:	串口接收FIFO半满状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  接收FIFO半满  0  接收FIFO没有半满
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_RXFIFOHalfFullState(UART_TypeDef * UARTx)
{
	uint8_t State = 0;
	
	if(UARTx->IF & UART_IF_RXFIFO_HFULL_MSK)
	{
		State = 1;
	}
	
	return State;
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_TXFIFOEmptyState()
* 功能说明:	串口发送FIFO空状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  发送FIFO空  0  发送FIFO非空
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_TXFIFOEmptyState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_TXFIFO_EMPTY_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_TXFIFOFullState()
* 功能说明:	串口发送FIFO满状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  发送FIFO满  0  发送FIFO没有满
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_TXFIFOFullState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_TXFIFO_FULL_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_TXFIFOHalfFullState()
* 功能说明:	串口发送FIFO半满状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  发送FIFO半满  0  发送FIFO没有半满
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_TXFIFOHalfFullState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_TXFIFO_HFULL_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_TXBusyState()
* 功能说明:	串口发送忙状态
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 1  发送忙  0  发送不忙
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_TXBusyState(UART_TypeDef * UARTx)
{
	return (UARTx->IF & UART_IF_TXBUSY_MSK) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_RXFIFOLevelState()
* 功能说明:	串口接收FIFO水位
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 接收FIFO水位
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_RXFIFOLevelState(UART_TypeDef * UARTx)
{
	uint8_t level = 0;
	
	level = ((UARTx->IF >> UART_IF_RX_LEVEL_POS) & 0x07);
	
	if(level == 0)
	{
		if(UARTx->IF & UART_IF_RXFIFO_FULL_MSK)
		{
			level = 8;
		}
	}
	
	return level;
}


/****************************************************************************************************************************************** 
* 函数名称:	UART_TXFIFOLevelState()
* 功能说明:	串口发送FIFO水位
* 输    入: UART_TypeDef * UARTx     UART0   UART1   UART2
* 输    出: 发送FIFO水位
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t UART_TXFIFOLevelState(UART_TypeDef * UARTx)
{
	uint8_t level = 0;
	
	
	level = ((UARTx->IF >> UART_IF_TX_LEVEL_POS) & 0x07);
	
	if(level == 0)
	{
		if(UARTx->IF & UART_IF_TXFIFO_FULL_MSK)
		{
			level = 8;
		}
	}
	
	return level;
}


void UART_RX_Stop_2bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
    temp |= (0x01 << 14);
	
	UARTx->CTRL = temp;
}


void UART_TXRX_Stop_2bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x01 << 14);
	
	UARTx->CTRL = temp;
}


void UART_TX_Stop_1bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x00 << 14);
	
	UARTx->CTRL = temp;
}

void UART_TX_Stop_2bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x01 << 14);
	
	UARTx->CTRL = temp;
}

void UART_TX_Stop_2bit_Idle_1bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x02 << 14);
	
	UARTx->CTRL = temp;
}

void UART_TX_Stop_2bit_Idle_2bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x03 << 14);
	
	UARTx->CTRL = temp;
}

void UART_TX_Stop_2bit_Idle_3bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x04 << 14);
	
	UARTx->CTRL = temp;
}

void UART_TX_Stop_2bit_Idle_4bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x05 << 14);
	
	UARTx->CTRL = temp;
}

void UART_TX_Stop_2bit_Idle_5bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x06 << 14);
	
	UARTx->CTRL = temp;
}

void UART_TX_Stop_2bit_Idle_6bit(UART_TypeDef * UARTx)
{
	uint32_t temp = 0;
	
	temp = UARTx->CTRL;
	
	temp &= ~(0x07 << 14);
	temp |= (0x07 << 14);
	
	UARTx->CTRL = temp;
}


